export const questions = [
	{
	  title: 'React - это ...',
	  variants: ['библиотека', 'фреймворк', 'приложение'],
	  correct: 0,
	},
	{
	  title: 'Компонент - это ...',
	  variants: ['приложение', 'часть приложения или страницы', 'то, что я не знаю что такое'],
	  correct: 1,
	},
	{
	  title: 'Что такое JSX?',
	  variants: [
		 'Это простой HTML',
		 'Это функция',
		 'Это тот же HTML, но с возможностью выполнять JS-код',
	  ],
	  correct: 2,
	},
	{
		title: 'Хук useMemo ...',
		variants: [
		  'Позволяет мемоизировать ссылку на функцию',
		  'Позволяет мемоизировать значение функции',
		  'Возвращает объект пары key/value параметров URL',
		],
		correct: 1,
	 },
	 {
		title: 'Хук useCallback ...',
		variants: [
			'Позволяет мемоизировать ссылку на функцию',
			'Позволяет мемоизировать значение функции',
			'Возвращает объект пары key/value параметров URL',
		],
		correct: 0,
	 },
	 {
		title: 'Хук useParams ...',
		variants: [
			'Позволяет мемоизировать ссылку на функцию',
			'Позволяет мемоизировать значение функции',
			'Возвращает объект пары key/value параметров URL',
		],
		correct: 2,
	 },
	 {
		title: 'В React Router для показа 404 ошибки необходимо в path в качестве значения указать ...',
		variants: [
			'0',
			'/',
			'*',
		],
		correct: 2,
	 },
 ];